# Datos del Titanic

In [6]:
import seaborn as sns
import numpy as numpy
import pandas as pd

In [7]:
titanic = sns.load_dataset("titanic")

In [8]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
titanic['survived'] = pd.Categorical(titanic['survived']) #Pasar a factor SURVIVED

In [10]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])

# Tblas de contingencia de una variable

In [11]:
tab=pd.crosstab(index=titanic['survived'],columns='pasajeros') #contruye un data frame que cuenta las variables de la informacion que le vas pasando
tab

col_0     pasajeros
survived
0               549
1               342

In [13]:
titanic.shape

(891, 15)

In [14]:
type(tab) # para ver el tipo que es

pandas.core.frame.DataFrame

In [16]:
pd.crosstab(index=titanic['pclass'], columns=['pasajeros'])

col_0   pasajeros
pclass
1             216
2             184
3             491

In [17]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [18]:
pd.crosstab(index=titanic['sex'], columns=['pasajeros'])

col_0   pasajeros
sex
female        314
male          577

In [23]:
titanic['deck'] = pd.Categorical(titanic['deck'])#para tomar los datos Nan

In [24]:
pd.crosstab(index=titanic['deck'], columns='count')

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [25]:
titanic.deck

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): [A, B, C, D, E, F, G]

In [27]:
tab_c=pd.crosstab(index=titanic['deck'], columns='count')
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [28]:
tab_c.sum()

col_0
count    203
dtype: int64

In [29]:
tab_c.shape

(7, 1)

In [30]:
tab_c.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [32]:
(tab_c/tab_c.sum())*100

col_0      count
deck
A       7.389163
B      23.152709
C      29.064039
D      16.256158
E      15.763547
F       6.403941
G       1.970443

In [36]:
sobrevi = pd.crosstab(index=titanic['survived'], columns='a')

sobrevi

col_0       a
survived
0         549
1         342

In [37]:
sobrevi/sobrevi.sum()*100

col_0             a
survived
0         61.616162
1         38.383838

In [38]:
#mujeres proporcion proporcion de gente 3ra clase

In [39]:
sexo = pd.crosstab(index=titanic['sex'], columns=['pasajeros'])

In [40]:
sexo/sexo.sum()*100

col_0   pasajeros
sex
female  35.241302
male    64.758698

In [42]:
clase=pd.crosstab(index=titanic['pclass'], columns='b')
clase/clase.sum()*100

col_0           b
pclass
1       24.242424
2       20.650954
3       55.106622

# Tablas de contingencia de dos variables

In [44]:
survived_sex=pd.crosstab(index=titanic['survived'], columns= titanic['sex'])
survived_sex.index=['died','survived'] # cambiar el nombre de las filas
survived_sex

sex       female  male
died          81   468
survived     233   109

In [47]:
survived_class= pd.crosstab(index = titanic['survived'],columns= titanic['pclass'])
survived_class.index=["died","survived"]
survived_class.columns=["primera","segunda","tercera"]
survived_class

          primera  segunda  tercera
died           80       97      372
survived      136       87      119

In [51]:
survived_class= pd.crosstab(index = titanic['survived'],columns= titanic['pclass'], margins= True)
survived_class.index=["died","survived","total_clase"]
survived_class.columns=["primera","segunda","tercera","total_pasajero"]
survived_class

#Agregar la suma de cada fila y columna margins agregar la fila y columna para que se vean

             primera  segunda  tercera  total_pasajero
died              80       97      372             549
survived         136       87      119             342
total_clase      216      184      491             891

# Frecuencias relativas globales

In [56]:
survived_class/survived_class.loc["total_clase","total_pasajero"]*100 #con loc accedes a las coordendas del dataframe

               primera    segunda    tercera  total_pasajero
died          8.978676  10.886644  41.750842       61.616162
survived     15.263749   9.764310  13.355780       38.383838
total_clase  24.242424  20.650954  55.106622      100.000000

### Frecuencias relativas marginales

In [66]:
survived_class/survived_class.loc["total_clase"]*100 # Se hace para sacar el porcentaje por columna (Funcion relativa marginal)

                primera     segunda     tercera  total_pasajero
died          37.037037   52.717391   75.763747       61.616162
survived      62.962963   47.282609   24.236253       38.383838
total_clase  100.000000  100.000000  100.000000      100.000000

In [65]:
survived_class.div(survived_class.loc["total_clase"],axis=1)*100 #Funcion relativa marginal

                primera     segunda     tercera  total_pasajero
died          37.037037   52.717391   75.763747       61.616162
survived      62.962963   47.282609   24.236253       38.383838
total_clase  100.000000  100.000000  100.000000      100.000000

In [61]:
survived_class.T/survived_class["total_pasajero"]*100
# Se hace para sacar el porcentaje por filas

                      died    survived  total_clase
primera          14.571949   39.766082    24.242424
segunda          17.668488   25.438596    20.650954
tercera          67.759563   34.795322    55.106622
total_pasajero  100.000000  100.000000   100.000000

In [63]:
survived_class.div(survived_class["total_pasajero"],axis=0)*100 # Se hace para sacar el porcentaje por filas

               primera    segunda    tercera  total_pasajero
died         14.571949  17.668488  67.759563           100.0
survived     39.766082  25.438596  34.795322           100.0
total_clase  24.242424  20.650954  55.106622           100.0

# Tablas multidimensionales

In [67]:
surv_sex_clase=pd.crosstab(index=titanic['survived'],
                            columns=[titanic['sex'],titanic['pclass']],
                            margins=True)

surv_sex_clase

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [69]:
surv_sex_clase['female']# estraer subtablas

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [70]:
surv_sex_clase['female'][1]

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [72]:
surv_sex_clase/surv_sex_clase.loc["All"]*100 # relativa Global para cada una de las columnas

sex           female                           male                          \
pclass             1           2      3           1           2           3
survived
0           3.191489    7.894737   50.0   63.114754   84.259259   86.455331
1          96.808511   92.105263   50.0   36.885246   15.740741   13.544669
All       100.000000  100.000000  100.0  100.000000  100.000000  100.000000

sex              All
pclass
survived
0          61.616162
1          38.383838
All       100.000000